RSN/src/Catalogs/ОбменыДанных/ОбменыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбменыДанных</name>
  <predefined>
    <items>
      <name>РезультатыОбменаБазДанных</name>
      <description>Результаты обмена баз дан</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикРезультата</name>
    <type>
      <types>CatalogRef.ОбработчикиРезультатовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиРассылки</name>
    <type>
      <types>CatalogRef.НастройкиРассылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчищатьОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьСписокБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресаРассылок</name>
    <attributes>
      <name>ЭлектронныйАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоОшибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/ОбменыДанных/ManagerModule.bsl
Функция ПолучитьАдресаРассылки (СсылкаСправочникОбменыДанными, ТолькоОшибки = Ложь) Экспорт


    // Получаем список адресов электронной почты из табличной части справочника
    ЗапросАдреса = Новый Запрос;
    ЗапросАдреса.Текст = 
    "ВЫБРАТЬ
    |	ОбменыДанныхАдресаРассылок.ЭлектронныйАдрес КАК ЭлектронныйАдрес
    |ИЗ
    |	Справочник.ОбменыДанных.АдресаРассылок КАК ОбменыДанныхАдресаРассылок
    |ГДЕ
    |	ОбменыДанныхАдресаРассылок.Ссылка = &Ссылка";

    ЗапросАдреса.УстановитьПараметр("Ссылка", СсылкаСправочникОбменыДанными);
    РезультатЗапроса = ЗапросАдреса.Выполнить();
    ТаблицаАдресов = РезультатЗапроса.Выгрузить();

    // Формируем строку адресов через точку с запятой
    СтрокаАдресов = "";
    Для Каждого СтрокаИзТЧ Из ТаблицаАдресов Цикл
        Если НЕ ПустаяСтрока(СтрокаИзТЧ.ЭлектронныйАдрес) Тогда
            Если СтрокаАдресов = "" Тогда
                СтрокаАдресов = СтрокаИзТЧ.ЭлектронныйАдрес;
            Иначе
                СтрокаАдресов = СтрокаАдресов + "; " + СтрокаИзТЧ.ЭлектронныйАдрес;
            КонецЕсли;
        КонецЕсли;
	КонецЦикла; 
	
    Возврат СтрокаАдресов;
	
КонецФункции
